Revit 2027 API
EnergyAnalysisConstruction.GetMaterialIds Method
Overload List
Name | Description
GetMaterialIds() |  Returns a list of ids of the associated materials to analytical construction.
GetMaterialIds(Boolean) |  Gets the element ids of all materials present in the element.
Top
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace